Процедура ПроверитьРасширение()
    БазовыйРеквизит = "база";
    РасшРеквизит = "расширение";
    Для каждого Строка Из Товары Цикл
        Строка.Номенклатура = "товар";
        Строка.Количество = "один";
        Строка.РасшПоле = "расширение";
        Строка.НетТакогоВЦикле = 1;
    КонецЦикла;

    НоваяСтрока = Товары.Добавить();
    НоваяСтрока.Номенклатура = "товар";
    НоваяСтрока.Количество = "один";
    НоваяСтрока.РасшПоле = "расширение";
    НоваяСтрока.НетТакогоПослеДобавить = 1;

    НоваяРасшСтрока = РасшТаблица.Добавить();
    НоваяРасшСтрока.Добавлено = "значение";
    НоваяРасшСтрока.НетТакогоВРасшТаблице = 1;

    Запрос = Новый Запрос("ВЫБРАТЬ Т.Номенклатура, Т.Количество, Т.РасшПоле, Т.НетТакогоВЗапросе ИЗ Документ.Заказ.Товары КАК Т");
КонецПроцедуры
