Процедура ПроверитьБазу()
    БазовыйРеквизит = "база";
    Для каждого Строка Из Товары Цикл
        Строка.Номенклатура = "товар";
        Строка.Количество = 1;
        Строка.РасшПоле = "недоступно";
        Строка.НетТакогоВЦикле = 1;
    КонецЦикла;

    Документ = Документы.Заказ.СоздатьДокумент();
    КонтрольнаяСтрока = Документ.Товары.Добавить();
    КонтрольнаяСтрока.Номенклатура = "товар";
    КонтрольнаяСтрока.Количество = 1;
    КонтрольнаяСтрока.РасшПоле = "недоступно";
    КонтрольнаяСтрока.НетТакогоПослеДобавить = 1;

    Запрос = Новый Запрос("ВЫБРАТЬ Т.Номенклатура, Т.Количество, Т.РасшПоле, Т.НетТакогоВЗапросе ИЗ Документ.Заказ.Товары КАК Т");
КонецПроцедуры
