Процедура ПроверитьОбработку()
    Документ = Документы.заказ.СоздатьДокумент();
    НоваяСтрока = Документ.товары.Добавить();
    НоваяСтрока.номенклатура = "товар";
    НоваяСтрока.Количество = "один";
    НоваяСтрока.РасшПоле = "расширение";
    НоваяСтрока.ЗависимоеПоле = "зависимое";
    НоваяСтрока.НетТакогоПослеДобавить = 1;

    Для каждого ВнешняяСтрока Из Документ.товары Цикл
        ВнешняяСтрока.номенклатура = "товар";
        ВнешняяСтрока.Количество = "один";
        ВнешняяСтрока.РасшПоле = "расширение";
        ВнешняяСтрока.НетТакогоВЦикле = 1;
    КонецЦикла;

    Запрос = Новый Запрос("ВЫБРАТЬ Т.номенклатура, Т.Количество, Т.РасшПоле, Т.ЗависимоеПоле, Т.НетТакогоВЗапросе ИЗ Документ.заказ.товары КАК Т");
КонецПроцедуры
